TESTQA/ICL_KIR.txt

<soapenv:Envelope xmlns:icl="http://www.ICLNBI.com/ICLNBI_V2.00.xsd" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <SearchResourceRequest xmlns="http://www.ICLNBI.com/ICLNBI_V2.00.xsd">
         <MessageElements xmlns="">
            <MessageAddressing>
               <from>RESOLVE</from>
               <to>ICL</to>
               <messageID/>
               <action>GETRELATEDSERVICES</action>
               <timestamp>2017-07-25 14:28:19.507</timestamp>
               <transactionID/>
               <serviceName>SearchResource</serviceName>
               <serviceVersion>3.1</serviceVersion>
            </MessageAddressing>
         </MessageElements>
         <SearchResourceDetails xmlns="">
            <commonName>DS1IT-16143679</commonName>
            <entity>SERVICE</entity>
            <level>SERVICE</level>
            <scope>DETAILED</scope>
            <sourceSystem>LIMS</sourceSystem>
         </SearchResourceDetails>
      </SearchResourceRequest>
   </soapenv:Body>
</soapenv:Envelope>